{
  "projectHeader": {

    "title": "Interactive Life Simulation Game",
    "subtitle": "An immersive, web-based life simulation game where every story is unique. Users create a character, choose perks, and make choices that guide their life, with all narratives, events, and outcomes dynamically generated by Google's Gemini AI.",
    "liveDemoLink": "https://arjundasgodson.pythonanywhere.com",
    "gitlink":"https://github.com/ArjunDas2003/lifesim"
},
    "projectContent": {
    "thumbnail": {
      "src": "./images/life-sim-thumbnail.png",
      "alt": "Life Simulation Game Thumbnail"
    },

    "projectOverview": [
      "The Interactive Life Simulation Game is an innovative web application that leverages the power of artificial intelligence to create unique, personalized life experiences for each user. Built with Flask and powered by Google's Gemini AI, this game allows players to create a character, make choices, and experience a life story that unfolds dynamically based on their decisions.",
      "This project was born from the idea of creating a truly interactive storytelling experience where no two playthroughs are the same. Traditional life simulation games often rely on pre-written scripts and limited branching narratives, but this game uses advanced AI to generate events, dialogue, and outcomes in real-time, creating an experience that feels organic and unpredictable.",
      "The game begins with character creation, where players can choose character name and gender and perks. From there, they navigate through various life stages year by year, making decisions that shape their character's personality, relationships, career, and overall life trajectory. The AI responds to these choices, creating a coherent and engaging narrative that reflects the player's actions."
    ],

    "technologyStack": [
      { "name": "Python", "icon": "fab fa-python" },
      { "name": "Flask", "icon": "fas fa-flask" },
      { "name": "Google Gemini AI", "icon": "fas fa-brain" },
      { "name": "SQLite", "icon": "fas fa-database" },
      { "name": "Flask-Login", "icon": "fas fa-users" },
      { "name": "Flask-SQLAlchemy", "icon": "fas fa-database" },
      { "name": "HTML5", "icon": "fab fa-html5" },
      { "name": "CSS3", "icon": "fab fa-css3-alt" },
      { "name": "JavaScript", "icon": "fab fa-js-square" }
    ],

    "keyFeatures": [
      {
        "title": "Character Creation",
        "items": [
          "Randomised attributes",
          "Selection of initial perks and traits",
          "Background story generation"
        ]
      },
      {
        "title": "Dynamic Storytelling",
        "items": [
          "AI-generated narratives and events",
          "Choice-driven gameplay",
          "Consequential decisions",
          "Non-linear story progression"
        ]
      },
      {
        "title": "Life Stages",
        "items": [
          "Childhood, adolescence, adulthood, and old age",
          "Age-appropriate events and challenges",
          "Character development over time",
          "Life milestones and achievements"
        ]
      },
      {
        "title": "Relationships",
        "items": [
          "Dynamic relationship system",
          "Family, friends, and romantic partners",
          "Relationship evolution based on choices",
          "Social interactions and networking"
        ]
      },
      {
        "title": "Career and Education",
        "items": [
          "Multiple career paths",
          "Educational choices and opportunities",
          "Professional achievements and challenges"
        ]
      },
      {
        "title": "User Experience",
        "items": [
          "Intuitive interface",
          "Auto Save and load game functionality",
          "Global Leaderboard"
        ]
      }
    ],

    "developmentProcess": [
      "The development of the Interactive Life Simulation Game was a challenging yet rewarding endeavor that pushed the boundaries of what's possible with current AI technology. The project began with extensive research into life simulation games and storytelling mechanics, as well as experimentation with various AI models to determine the best fit for generating coherent and engaging narratives.",
      "Flask was chosen as the backend framework for its simplicity and flexibility, allowing for rapid development and easy integration with various Python libraries. The frontend was built with standard web technologies to ensure compatibility and ease of maintenance.",
      "One of the key challenges was designing a system that could generate coherent narratives while maintaining player agency. This required careful prompt engineering and the development of a context management system that tracks the player's choices and character state throughout the game. The Google Gemini 1.5 Flash model was selected for its ability to understand context and generate human-like text, making it ideal for creating immersive story experiences.",
      "The game's architecture was designed with modularity in mind, allowing for easy expansion and addition of new features. User authentication and game state management were implemented using Flask-Login and Flask-SQLAlchemy, ensuring that players could save their progress and return to their games at any time."
    ],

    "screenshots": [
      { "src": "./images/life-sim (1).png", "alt": "life-sim  screenshot 1" },
      { "src": "./images/life-sim (2).png", "alt": "life-sim  screenshot 2" },
      { "src": "./images/life-sim (3).png", "alt": "life-sim  screenshot 3" },
      { "src": "./images/life-sim (4).png", "alt": "life-sim  screenshot 4" }
    ],

    "liveDemo": {
      "iframeSrc": "https://arjundasgodson.pythonanywhere.com",
        "alt": "Live demo of Life Simulation Game"
    }
  }
}

